export const WithdrawStatus = {
  0: {
    label: '审核中',
    color: '#ffb000',
  },
  1: {
    label: '已通过',
    color: '#669900',
  },
  2: {
    label: '被驳回',
    color: '#dd4a68',
  },
}

export const IncomeStatus = {
  1: {
    label: '收入',
    color: '#669900',
    str: '+',
  },
  2: {
    label: '支出',
    color: '#dd4a68',
    str: '-',
  },
}

export const StoreStatus = {
  1: {
    label: '正常',
    color: '#690',
  },
  2: {
    label: '审核',
    color: '#ffb000',
  },
  4: {
    label: '禁用',
    color: '#dd4a68',
  },
}

export const TemplateArea = {
  0: ['同城', 0],
  1: ['北京', 0],
  21: ['上海', 0],
  42: ['天津', 0],
  62: ['重庆', 0],
  104: ['安徽', 0],
  227: ['福建', 0],
  322: ['甘肃', 0],
  423: ['广东', 0],
  566: ['广西', 0],
  690: ['贵州', 0],
  788: ['海南', 0],
  814: ['河北', 0],
  998: ['河南', 0],
  1176: ['黑龙江', 0],
  1320: ['湖北', 0],
  1436: ['湖南', 0],
  1573: ['吉林', 0],
  1643: ['江苏', 0],
  1763: ['江西', 0],
  1874: ['辽宁', 0],
  1989: ['内蒙古', 0],
  2103: ['宁夏', 0],
  2130: ['青海', 0],
  2182: ['山东', 0],
  2340: ['山西', 0],
  2471: ['陕西', 0],
  2589: ['四川', 0],
  2792: ['西藏', 0],
  2873: ['新疆', 0],
  2987: ['云南', 0],
  3133: ['浙江', 0],
  3235: ['香港', 0],
  3239: ['澳门', 0],
  3242: ['台湾', 0],
}

export const DeliverType = {
  0: '系统配送',
  1: '商家配送',
  2: '用户自提',
  3: '快递配送',
}
